tako0910/py32f0-template/Libraries/PY32F032_LL_Driver/Inc/py32f032_ll_comp.h
/** @defgroup COMP_LL_EC_COMMON_WINDOWMODE Comparator common modes - Window mode
  * @{
  */
#define LL_COMP_WINDOWMODE_DISABLE                 (0x00000000U)                                                    /*!< Window mode disable: Comparators 1 and 2 are independent */
#define LL_COMP_WINDOWMODE_COMP1_INPUT_PLUS_COMMON (COMP_CSR_WINMODE | LL_COMP_WINDOWMODE_COMP_EVEN_REGOFFSET_MASK)  /*!< Window mode enable: if used from COMP1 or COMP2 instance, comparators instances pair COMP1 and COMP2 have their input plus connected together, the common input is COMP1 input plus (COMP2 input plus is no more accessible). */
#define LL_COMP_WINDOWMODE_COMP2_INPUT_PLUS_COMMON (COMP_CSR_WINMODE | LL_COMP_WINDOWMODE_COMP_ODD_REGOFFSET_MASK)  /*!< Window mode enable: if used from COMP1 or COMP2 instance, comparators instances pair COMP1 and COMP2 have their input plus connected together, the common input is COMP2 input plus (COMP1 input plus is no more accessible). */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_INPUT_PLUS Comparator inputs - Input plus (input non-inverting) selection
  * @{
  */
#define LL_COMP_INPUT_PLUS_IO0         (0x00000000)                              /*!< Comparator input plus connected to IO0(pin PB8 for COMP1, pin PB4 for COMP2) */
#define LL_COMP_INPUT_PLUS_IO1         (COMP_CSR_INPSEL_0)                       /*!< Comparator input plus connected to IO1(pin PB2 for COMP1, pin PB6 for COMP2) */
#define LL_COMP_INPUT_PLUS_IO2         (COMP_CSR_INPSEL_1)                       /*!< Comparator input plus connected to IO2(pin PA1 for COMP1, pin PA3 for COMP2) */
#define LL_COMP_INPUT_PLUS_IO3         (COMP_CSR_INPSEL_1 | COMP_CSR_INPSEL_0)   /*!< Comparator input plus connected to IO3(pin PF3 for COMP2) */
#define LL_COMP_INPUT_PLUS_COMP1_OPA1  (COMP_CSR_INPSEL_1 | COMP_CSR_INPSEL_0)   /*!< Comparator input plus connected to COMP1_OPA1 */
#define LL_COMP_INPUT_PLUS_COMP1_OPA2  (COMP_CSR_INPSEL_2)                       /*!< Comparator input plus connected to COMP1_OPA2 */
#define LL_COMP_INPUT_PLUS_COMP2_OPA1  (COMP_CSR_INPSEL_2)                       /*!< Comparator input plus connected to COMP2_OPA1 */
#define LL_COMP_INPUT_PLUS_COMP2_OPA2  (COMP_CSR_INPSEL_2 | COMP_CSR_INPSEL_0)   /*!< Comparator input plus connected to COMP2_OPA2 */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_INPUT_MINUS Comparator inputs - Input minus (input inverting) selection
  * @{
  */
#define LL_COMP_INPUT_MINUS_COMP1_IO0     (0x00000000UL)                                              /*!< Comparator input minus connected to IO0(pin PB1 for COMP1) */
#define LL_COMP_INPUT_MINUS_COMP1_IO1     (                                        COMP_CSR_INMSEL_1) /*!< Comparator input minus connected to IO1(pin PA0 for COMP1) */
#define LL_COMP_INPUT_MINUS_COMP1_OPA1    (                    COMP_CSR_INMSEL_2                    ) /*!< Comparator input minus connected to COMP1_OPA1  */ 
#define LL_COMP_INPUT_MINUS_COMP1_VREFCMP (                    COMP_CSR_INMSEL_2 | COMP_CSR_INMSEL_1) /*!< Comparator input minus connected to COMP1_VREFCMP */
#define LL_COMP_INPUT_MINUS_COMP1_TS_VIN  (COMP_CSR_INMSEL_3                                        ) /*!< Comparator input minus connected to COMP1_TS_VIN  */ 
#define LL_COMP_INPUT_MINUS_COMP1_VREFINT (COMP_CSR_INMSEL_3                     | COMP_CSR_INMSEL_1) /*!< Comparator input minus connected to COMP1_VREFINT */ 
#define LL_COMP_INPUT_MINUS_COMP1_VREFBUF (COMP_CSR_INMSEL_3 | COMP_CSR_INMSEL_2                    ) /*!< Comparator input minus connected to COMP1_VREFBUF */ 
#define LL_COMP_INPUT_MINUS_COMP1_OPA2    (COMP_CSR_INMSEL_3 | COMP_CSR_INMSEL_2 | COMP_CSR_INMSEL_1) /*!< Comparator input minus connected to COMP1_OPA2 */


#define LL_COMP_INPUT_MINUS_COMP2_IO0     (0x00000000)                                                                    /*!< Comparator input minus connected to IO0(PA2 for COMP2) */ 
#define LL_COMP_INPUT_MINUS_COMP2_IO1     (                                                            COMP_CSR_INMSEL_0) /*!< Comparator input minus connected to IO1(PB7 for COMP2) */ 
#define LL_COMP_INPUT_MINUS_COMP2_IO2     (                                        COMP_CSR_INMSEL_1                    ) /*!< Comparator input minus connected to IO2(PB3 for COMP2) */ 
#define LL_COMP_INPUT_MINUS_COMP2_VREFCMP (                                        COMP_CSR_INMSEL_1 | COMP_CSR_INMSEL_0) /*!< Comparator input minus connected to COMP2_VREFCMP */
#define LL_COMP_INPUT_MINUS_COMP2_TS_VIN  (                    COMP_CSR_INMSEL_2                                        ) /*!< Comparator input minus connected to COMP2_TS_VIN */ 
#define LL_COMP_INPUT_MINUS_COMP2_VREFINT (                    COMP_CSR_INMSEL_2                     | COMP_CSR_INMSEL_0) /*!< Comparator input minus connected to COMP2_VREFINT */ 
#define LL_COMP_INPUT_MINUS_COMP2_VREFBUF (                    COMP_CSR_INMSEL_2 | COMP_CSR_INMSEL_1                    ) /*!< Comparator input minus connected to COMP2_VREFBUF */ 
#define LL_COMP_INPUT_MINUS_COMP2_OPA1    (                    COMP_CSR_INMSEL_2 | COMP_CSR_INMSEL_1 | COMP_CSR_INMSEL_0) /*!< Comparator input minus connected to COMP2_OPA1 */
#define LL_COMP_INPUT_MINUS_COMP2_OPA2    (COMP_CSR_INMSEL_3                                                            ) /*!< Comparator input minus connected to COMP2_OPA2 */
/**
  * @}
  */

/** @defgroup COMP_LL_INTERNAL_DIGITAL_OUTPUT Comparator Internal digital output control
  * @{
  */
#define LL_COMP_INTERNAL_OUTPUT_NOFILTER        (0x00000000U)
#define LL_COMP_INTERNAL_OUTPUT_FILTER          (COMP_CSR_INT_OUT_SEL)
/**
  * @}
  */   

/** @defgroup COMP_LL_EC_OUTPUT_POLARITY Comparator output - Output polarity
  * @{
  */
#define LL_COMP_OUTPUTPOL_NONINVERTED       (0x00000000U)           /*!< COMP output polarity is not inverted: comparator output is high when the plus (non-inverting) input is at a higher voltage than the minus (inverting) input */
#define LL_COMP_OUTPUTPOL_INVERTED          (COMP_CSR_POLARITY)     /*!< COMP output polarity is inverted: comparator output is low when the plus (non-inverting) input is at a lower voltage than the minus (inverting) input */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_OUTPUT_BLANKING_SOURCE Comparator output - Blanking source
  * @{
  */
#define LL_COMP_BLANKINGSRC_NONE      (0x00000000UL)                                /*!<Comparator output without blanking */
#define LL_COMP_BLANKINGSRC_TIM1_OC4  (                      COMP_CSR_BLANKSEL_0)   /*!< Comparator output blanking source TIM1 OC4  (Common to all COMP instances). Note: For COMPx instance availability, please refer to datasheet */
#define LL_COMP_BLANKINGSRC_TIM1_OC5  (COMP_CSR_BLANKSEL_1                      )   /*!< Comparator output blanking source TIM1 OC5  (Common to all COMP instances). Note: For COMPx instance availability, please refer to datasheet */
#define LL_COMP_BLANKINGSRC_TIM3_OC3  (COMP_CSR_BLANKSEL_1 | COMP_CSR_BLANKSEL_0)   /*!< Comparator output blanking source TIM3 OC3  (Common to all COMP instances). Note: For COMPx instance availability, please refer to datasheet */

/**
  * @}
  */

/** @defgroup COMP_LL_EC_OUTPUT_LEVEL Comparator output - Output level
  * @{
  */
#define LL_COMP_OUTPUT_LEVEL_LOW            (0x00000000U)          /*!< Comparator output level low  (if the polarity is not inverted, otherwise to be complemented) */
#define LL_COMP_OUTPUT_LEVEL_HIGH           (0x00000001U)          /*!< Comparator output level high (if the polarity is not inverted, otherwise to be complemented) */

/**
  * @}
  */

/** @defgroup COMP_LL_EC_INPUT_HYSTERESIS Comparator Hysteresis
  * @{
  */
#define LL_COMP_HYSTERESIS_ENABLE           (COMP_CSR_HYST)        /*!< Comparator Hysteresis Enable */
#define LL_COMP_HYSTERESIS_DISABLE          (0x00000000U)          /*!< Comparator Hysteresis Disable */
/**
  * @}
  */

